MessageContractDemoClient/MessageContractDemoClient/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T13:53:12.3480387Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{60cb2d4b-7b86-437d-a0f5-3f7436fa80d2}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="9" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T19:23:12.3430892+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="600d0bc9-7398-4dcc-87f5-341ca066bd4b" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>5</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T13:53:12.3647510Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{60cb2d4b-7b86-437d-a0f5-3f7436fa80d2}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="9" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T19:23:12.3647510+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>432</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 23 Mar 2020 13:53:12 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult xmlns:a="http://EmployeeServiceLibrary.com/2020/03/23/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:ID>5</a:ID><a:Name>Rutwik</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>2000-04-20T00:00:00</a:DateOfBirth></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T13:54:08.2483579Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{66ef8f96-955c-4154-bff6-d8b48031e6ae}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="9" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T19:24:08.2473592+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="f440a903-dd3b-4027-9ae3-9f56c62173fa" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>5</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T13:54:08.2563343Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{66ef8f96-955c-4154-bff6-d8b48031e6ae}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="9" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T19:24:08.2563343+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>432</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 23 Mar 2020 13:54:08 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult xmlns:a="http://EmployeeServiceLibrary.com/2020/03/23/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:ID>5</a:ID><a:Name>Rutwik</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>2000-04-20T00:00:00</a:DateOfBirth></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T13:54:29.6332163Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{cc2909df-c54b-453a-8158-838171dd6019}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="15" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T19:24:29.6302242+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="fa701322-4ddf-402c-99c0-75b0590e5471" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><id>5</id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T13:54:29.6462183Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{cc2909df-c54b-453a-8158-838171dd6019}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="15" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T19:24:29.6452148+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>432</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 23 Mar 2020 13:54:29 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult xmlns:a="http://EmployeeServiceLibrary.com/2020/03/23/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:ID>5</a:ID><a:Name>Rutwik</a:Name><a:Gender>Male</a:Gender><a:DateOfBirth>2000-04-20T00:00:00</a:DateOfBirth></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T14:35:57.8223853Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{afe920bb-876f-4383-9fa9-54ce8f6b5445}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="65" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T20:05:57.8153352+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="bc5cb5c1-781d-4aff-9f0f-240359a3f8a1" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeRequestObject xmlns="http://EmployeeServiceLibrary.com/Employee"><EmployeeId>5</EmployeeId><LicenseKey>XxYyZz1AaBbCc</LicenseKey></EmployeeRequestObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T14:35:57.9539711Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{afe920bb-876f-4383-9fa9-54ce8f6b5445}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="65" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T20:05:57.9539711+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>266</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 23 Mar 2020 14:35:57 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><EmployeeInfoObject xmlns="http://EmployeeServiceLibrary.com/Employee"><ID>5</ID><Name>Rutwik</Name><Gender>Male</Gender><DOB>2000-04-20T00:00:00</DOB></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T14:37:43.3934911Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{136e8953-1e09-42f9-94bc-a1b386649af6}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="65" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T20:07:43.3934911+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="6c0d3d77-a795-47d1-9ff5-a0b9c09beaad" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeInfoObject xmlns="http://EmployeeServiceLibrary.com/Employee"><ID>6</ID><Name>Monday</Name><Gender>Male</Gender><DOB>2000-04-20T00:00:00</DOB></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T14:37:43.4244081Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{136e8953-1e09-42f9-94bc-a1b386649af6}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="65" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T20:07:43.4234113+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>86</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 23 Mar 2020 14:37:43 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T14:37:47.5873183Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4777507b-4dde-4078-84e1-5952ce454456}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="69" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T20:07:47.5873183+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="9212f98d-7cad-4b47-bd6d-8703f570489b" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeRequestObject xmlns="http://EmployeeServiceLibrary.com/Employee"><EmployeeId>6</EmployeeId><LicenseKey>XxYyZz1AaBbCc</LicenseKey></EmployeeRequestObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-23T14:37:47.6102580Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{4777507b-4dde-4078-84e1-5952ce454456}" /><Execution ProcessName="iisexpress" ProcessID="6176" ThreadID="69" /><Channel/><Computer>DESKTOP-P98FK7A</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-23T20:07:47.6102580+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>2